"""
======================
Author: 柠檬班-小简
Time: 2021/1/13 20:18
Project: py37-编程基础
Company: 湖南零檬信息技术有限公司
======================
"""

"""
if 条件1:
    条件1为真的情况下，执行的代码(会干的事情)

if 条件1:
    条件1为真的情况下，执行的代码(会干的事情)
elif 条件2:
    条件2为真的情况下，执行的代码(会干的事情)
else:
    条件1和条件2都不为真的情况下，执行的代码(会干的事情)

"""
# score = input("请输入你的作业分数: ")
#
# if int(score) == 100:
#     print("太优秀了，学的太好了！！")
#     print("奖励一朵小红花！！")
#     print("太秀了！")
#
# print("**********************")
#
# if int(score) == 100:
#     print("太优秀了，学的太好了！！")
#     print("666666666666666")
# elif 80 <= int(score) < 100:
#     print("还不错，可以继续努力！")
# elif 60 <= int(score) < 80:
#     print("刚刚及格，加油！！")
# else:
#     print("得再加把劲儿！！")

# 输入一个星期一到星期天，双休。
# 根据输入的内容来判断，要上班，还是不要上班。
#　星期一二三四五　　都是要上班的。　六天　　不上班的。
working_day = ["星期一","星期二","星期三","星期四","星期五"]
weekend = ["星期六","星期天"]

value = input("请输入周一到周天：")
if value in working_day:
    print("guaiguai去上班")
elif value in weekend:
    print("happy，休息了！")
else:
    print("数据不在一周内！！")



